#Задание №1
# 15 * 3 (умножение)
number = (45)
print(type(number))
# 15 / 3 (деление)
number = (5)
print(type(number))
# 15 // 2 (целочисленное деление)
number = (7)
print(type(number))
# 15 ** 2 (возведение в степень)
number = (225)
print(type(number))
#Задание №2
#Список
str = ['В', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
print(str)
#Обработанный список
str = ['В', ' " ', '05', ' " ', 'часов', ' " ', '17', ' " ', 'минут', 'температура', 'воздуха', 'была', ' " ', '+05', ' " ', 'градусов']
print(str)
#Сформированный список из обработанного
lst = ['В', ' " ', '05', ' " ', 'часов', ' " ', '17', ' " ', 'минут', 'температура', 'воздуха', 'была', ' " ', '+05', ' " ', 'градусов']
print(" ".join(lst))
#Задание №3
# -
#Задание №4
employees_list = \
    ['инжинер-конструктор Игорь',
    'главный бухгалтер МАРИНА',
    'токарь высшего разряда нИКОЛАЙ',
    'директор аэлита']
for i in range(len(employees_list)):
    temp_str = employees_list[i].split()
    temp_str[-1] = temp_str[-1].capitalize()
    employees_list[i] = ' '.join(temp_str)
    print(f'Привет, {employees_list[i].split()[-1]}! ')
#Задание №5
#A
str_price = ['57.8, ', '46.51, ', '97, ', '43.7, ', '7.80, ', '90.56, ', '120.77, ', '103.89' ]
str_price = ' '.join(str_price)
print(str_price)
#B
number_list = ['57.8', '46.51', '97', '43.7', '7.80', '90.56', '120.77', '103.89' ]
sorted()
print(number_list)
#C
# -
#D
# -

#С 4 и 5 заданием явные проблемы, я их вообще не понял как делать и откуда что берется :(
